package ru.testproject.lists;

import java.util.ArrayList;

public class SandBox {
    /**
     * Задание с собеседования.
     * Вам нужно написать реализацию функции
     void merge(ArrayList a, ArrayList b) { // тело функции }

     Функция принимает два ArrayList одинакового размера [a1, a2, ..., an], [b1, b2, ..., bn].
     В результате выполнения функции в первом (!)
     ArrayList (в данном случае это А) должны содержаться элементы обоих ArrayList,
     которые чередуются последовательно, а именно
     [a1, b1, a2, b2, ..., an, bn]

     Оцениваться будет:

     - код должен работать корректно
     - выполнять полезную функцию
     - иметь максимально возможную эффективность (задумайтесь, пожалуйста, над тем насколько эффективно написанная вами функция будет использовать память и процессорное время)

     FAQ
     - Написать нужно именно тело функции
     - Времени отводится 30 минут*/

    /* Задание 1
    *
    *   Реализовать merge()
    *   Входящие:
    *   a[a1, a2, a3, ...]
    *   b[b1, b2, b3, ...]
    *   Выходящие:
    *   ab[a1, b1, a2, b2, a3, b3, ...]
    * */

    static final int SIZE = 100;

    public static void main(String[] args) {

//        System.out.println(merge(a, b));
    }

    public static ArrayList<String> merge(ArrayList<String> a, ArrayList<String> b) {

        return new ArrayList<>();
    }
}
